postUsuarios.yaml
config:
  environments:
    localhost:
      target: "http://localhost:3000"
      phases: 
      - name: "Warm up"
        duration: 15
        arrivalCount: 10  
      payload:
        path: "usuarios.csv"
        fields:
          - "nome"
          - "email"
          - "password"
          - "administrador"
scenarios:
  - name: "Cadastrar Usuario"
    flow:
      - post:
          url: "/usuarios"
          headers:
            content-type: "application/json"
          json:
            nome: "{{ nome }}"
            email: "{{ email }}"
            password: "{{ password }}"
            administrador: "{{ administrador }}"
          capture:
            - json: $._id
              as: userId
      - get:
          url: "/usuarios/{{userId}}"
      - delete:
          url: "/usuarios/{{userId}}"